{
    "app.title": "Learn TCM Through Listening, Speaking, Reading & Writing",
    
    "nav.appName": "ShanHan LSRW",
    "nav.features": "Features",
    "nav.howItWorks": "How It Works",
    "nav.testimonials": "Testimonials",
    "nav.tryNow": "Try Now",
    "nav.home": "Home",
    "nav.books": "Books",
    "nav.practice": "Learn",
    "nav.achievements": "Achievements",
    "nav.profile": "Profile",
    
    "hero.title": "Say Goodbye to Boring Memorization — Master TCM Classics the Fun Way!",
    "hero.subtitle": "Master Treatise on Cold Damage through four interactive learning modes with just 15 minutes daily.",
    "hero.primaryCta": "Start Free Trial",
    "hero.secondaryCta": "Watch Demo",
    "hero.userCount": "10,000+ users already learning",
    
    "problem.title": "Struggling with Traditional Chinese Medicine classics? You're not alone!",
    "problem.subtitle": "Traditional learning methods are inefficient and make many students lose interest, preventing you from truly mastering TCM essentials.",
    "problem.painPoints": "Three Major Challenges of Traditional Learning:",
    "problem.point1": "Tedious Memorization: Large amounts of ancient text requiring repetitive memorization",
    "problem.point2": "Single-dimensional Learning: Lack of multi-sensory engagement leads to poor retention",
    "problem.point3": "No Feedback: Unable to verify learning outcomes, making consistent study difficult",
    
    "solution.title": "ShanHan LSRW — A Revolutionary Learning Experience for TCM Classics",
    "solution.point1": "Four-dimensional Learning: Listening, Speaking, Reading, and Writing modes for comprehensive reinforcement",
    "solution.point2": "Gamified Experience: Turns boring into fun, making learning enjoyable",
    "solution.point3": "Scientific Planning: Just 15 minutes daily, master the entire text in 365 days",
    "solution.cta": "Start Your Efficient Learning Journey Now",
    
    "features.title": "Four Learning Modes to Boost Memory Efficiency",
    "features.subtitle": "Based on cognitive science, we designed four complementary learning modes to make your study twice as effective",
    "features.listen.title": "Listen — Auditory Enhancement",
    "features.listen.description": "Professional audio with pinyin display reinforces memory, learn anywhere anytime",
    "features.listen.scenario": "Scenario: During Commute",
    "features.listen.benefit": "Utilize fragmented time, enhance impression through auditory memory, boost memory efficiency by 40%",
    "features.speak.title": "Speak — Oral Enhancement",
    "features.speak.description": "Recording comparison and smart scoring improve pronunciation accuracy, deepening memory impression",
    "features.speak.scenario": "Scenario: After-class Review",
    "features.speak.benefit": "Through vocal memory, consolidate learning content, improving retention rate by 35%",
    "features.read.title": "Read — Reading Enhancement",
    "features.read.description": "Scratch-card style character reveal, gamified reading experience, increasing focus through fun",
    "features.read.scenario": "Scenario: Deep Learning",
    "features.read.benefit": "Through visual memory and interaction, improve content comprehension and memory effect by 45%",
    "features.write.title": "Write — Writing Enhancement",
    "features.write.description": "Smart input boxes with real-time correction, handwriting input experience, deepening memory consolidation",
    "features.write.scenario": "Scenario: Review & Reinforcement",
    "features.write.benefit": "Through handwriting input, deepen action memory, improve long-term memory retention by 50%",
    "features.cta": "Explore More Features",
    
    "value.title": "ShanHan LSRW — The Ultimate Tool to Boost TCM Learning Efficiency!",
    "value.subtitle": "We are committed to helping TCM learners achieve 300% efficiency improvement and 50% better memory retention in classics study",
    "value.efficiency.title": "300% Learning Efficiency Boost",
    "value.efficiency.description": "Through our four-dimensional learning method, compared to traditional learning, your efficiency will be tripled, mastering more knowledge in the same time",
    "value.retention.title": "50% Higher Memory Retention",
    "value.retention.description": "Multi-sensory learning activates different brain regions, significantly improving long-term memory retention, saying goodbye to 'learn and forget'",
    "value.progress.title": "Learning Progress Visualization",
    "value.progress.description": "Detailed learning data analysis and progress tracking, clearly understand your learning status, maintain learning motivation",
    "value.callout.title": "Just 15 Minutes Daily, Master the Entire Treatise on Cold Damage in One Year",
    "value.callout.description": "We've divided the Treatise on Cold Damage into 365 small units, one unit per day, requiring only 15 minutes daily. Stick with it easily, and in one year you'll have mastered this TCM classic",
    "value.callout.cta": "Start Your Learning Plan Now",
    
    "testimonials.title": "The Choice of Over 10,000 TCM Learners!",
    "testimonials.subtitle": "Hear what they say",
    "testimonials.user1.name": "Dr. Li",
    "testimonials.user1.title": "Associate Professor, TCM College",
    "testimonials.user1.comment": ""As a TCM educator, I strongly recommend this app to my students. It perfectly combines traditional classics with modern learning methods, and students' learning enthusiasm and results have improved significantly."",
    "testimonials.user2.name": "Zhang",
    "testimonials.user2.title": "Junior TCM Major Student",
    "testimonials.user2.comment": ""Memorizing the Treatise on Cold Damage used to be a nightmare. Since using this app, 15 minutes of daily learning has become so relaxing and effective. The gamified learning approach is addictive—I've been learning continuously for 60 days!"",
    "testimonials.user3.name": "Dr. Wang",
    "testimonials.user3.title": "TCM Clinic Director",
    "testimonials.user3.comment": ""As a TCM practitioner with years of experience, I've been looking for efficient ways to review classics. This app's four-dimensional learning method has rekindled my learning joy and allowed me to continuously improve myself despite my busy schedule."",
    "testimonials.partners.title": "Our Partners",
    "testimonials.cta": "Join Them in Starting Your Efficient Learning Journey",
    
    "howItWorks.title": "Simple and Easy, Three Steps to Start!",
    "howItWorks.subtitle": "Our design philosophy is to ensure every user can easily master the app's usage",
    "howItWorks.step1.title": "Choose Your Book",
    "howItWorks.step1.description": "Select from our curated TCM classics, such as Treatise on Cold Damage",
    "howItWorks.step2.title": "Set Learning Plan",
    "howItWorks.step2.description": "Choose daily character count and time, and the system will plan your learning progress",
    "howItWorks.step3.title": "Start Four-dimensional Learning",
    "howItWorks.step3.description": "Learn through alternating listening, speaking, reading, and writing modes to comprehensively enhance memory",
    "howItWorks.demo.title": "See How It Works",
    "howItWorks.demo.description": "Our carefully designed user interface makes learning simple and intuitive, enjoying efficient learning without complex operations",
    "howItWorks.demo.cta": "Watch Demo Video",
    
    "screenshots.title": "Preview — ShanHan LSRW Core Features",
    "screenshots.subtitle": "Swipe to discover how ShanHan LSRW makes TCM classics learning simple and fun",
    "screenshots.home": "Home",
    "screenshots.listen": "Listen Mode",
    "screenshots.speak": "Speak Mode",
    "screenshots.read": "Read Mode",
    "screenshots.write": "Write Mode",
    "screenshots.cta": "Experience Full App Demo — Get a Complete Preview!",
    
    "cta.title": "Ready to Boost Your TCM Learning Efficiency?",
    "cta.subtitle": "Join us, along with 10,000+ TCM enthusiasts, to begin an effortless and efficient learning journey",
    "cta.button": "Try 7 Days Free",
    "cta.note": "No credit card required, cancel anytime",
    "cta.benefit1": "Four-dimensional learning method, enhancing memory efficiency",
    "cta.benefit2": "Just 15 minutes daily, master the entire book in one year",
    "cta.benefit3": "Professional TCM content, accurate and reliable",
    
    "waitingList.title": "Get Early Access, Win at the Starting Line!",
    "waitingList.subtitle": "Join ShanHan LSRW exclusive beta testing waiting list to get beta invitation code, limited benefits, and exclusive discounts first! Limited spots, join now!",
    "waitingList.nameLabel": "Name (Optional)",
    "waitingList.namePlaceholder": "Your Name",
    "waitingList.emailLabel": "Email (Required)",
    "waitingList.emailPlaceholder": "Your Email",
    "waitingList.professionLabel": "Your Profession (Optional)",
    "waitingList.professionDefault": "Please Select",
    "waitingList.professionStudent": "TCM Student",
    "waitingList.professionDoctor": "TCM Doctor",
    "waitingList.professionTeacher": "TCM Teacher",
    "waitingList.professionEnthusiast": "TCM Enthusiast",
    "waitingList.professionOther": "Other",
    "waitingList.submit": "Join Waiting List, Get Beta Access",
    "waitingList.privacy": "By submitting, you agree to our Privacy Policy and Terms of Service",
    "waitingList.exclusive": "Beta users exclusive: 30-day free premium membership, exclusive learning material package",
    
    "youtube.title": "Real User Cases — See How ShanHan LSRW Helps TCM Learners Improve Learning Outcomes",
    "youtube.subtitle": "We've collected a series of real user experiences and learning achievements",
    "youtube.video1.title": "300% Efficiency Boost in Learning Treatise on Cold Damage — Li's Story",
    "youtube.video1.description": "Li shares how he mastered the Taiyang Disease section of Treatise on Cold Damage in two months through four learning modes",
    "youtube.video2.title": "App Comprehensive Demo — Understand LSRW Method in 15 Minutes",
    "youtube.video2.description": "Detailed demonstration of the app's four learning modes and usage methods, helping you quickly master usage techniques",
    "youtube.video3.title": "TCM School Recommendation — Professor Zhang on LSRW Method's Scientific Basis",
    "youtube.video3.description": "

